CARAVAN/app/controllers/blogs_controller.rb

  def create
    blog = Blog.new(blog_params)
    binding.pry
    blog.save
---
INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テストタイトル"], ["category", "テストカテゴリー"], ["body", "テスト本文"], ["created_at", "2021-04-05 09:45:08.373213"], ["updated_at", "2021-04-05 09:45:08.373213"]]

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "テスト更新"], ["category", "テスト更新"], ["body", "テスト更新"], ["updated_at", "2021-04-05 09:15:05.125630"], ["id", 1]]